{
	"activity": {
		"name": "trees grow"
	},
	"help": {
		"title": "Silvanus Help",
		"info": "Silvanus is the ultimate Grow A Tree companion bot! Quickly compare your server's tree to others on the leaderboard with automatic calculation of tree height differences, active growth detection, watering time calculations, and more!\n\nImportant Note: Silvanus is only as up-to-date as your server's newest Tree and Tallest Trees messages. Make sure to refresh them before refreshing Silvanus' Compare message.",
		"setup": "If your ``/tree`` and ``/top trees`` messages are in the same channel, simple run </compare:1065346941166297128> in that channel and you're good to go!\n\nOtherwise, run </setup:1065407649363005561> to set the proper channels for the bot to look in for the ``/tree`` and ``/top trees`` messages.\n\nUse </commands:1069501270454456331> to view a description of all my commands.",
		"permissions": "At a minimum, Silvanus requires permissions to `Send Messages` and `Send Messages in Threads` if applicable. If Analyzer is given permission to `Manage Messages`, the bot will delete the `.settree` and `.setranks` messages to reduce spam.",
 		"allCommands": "</setup:1065407649363005561> - You only need to run this command if your server has its ``/tree`` and ``/top trees`` messages in separate channels.\n</setupinfo:1065413032374706196> - Displays your server's configuration information.\n</compare:1065346941166297128> - Sends a refreshable embed that calculcates the height difference between your tree and the trees currently displayed on your Tallest Trees message. There is also an Active Growth Indicator (``[💧]``).\n</notifications:0> - Guild members with the ``Manage Roles`` permission can run this command to set up automatic reminders when your tree is ready to be watered or when fruit is dropping.\n    This feature relies on Grow A Tree's built-in Notification system. Refer to Grow A Tree for instructions on setting them up.\n    ``watchchannel``: Select the channel you've configured Grow A Tree to send notifications in.\n    ``watermessage``: This option sets the message to send when the tree is ready to be watered. This can include ``@pings``, links, etc.\n    ``pingchannel``: Select the channel you want Silvanus to forward the notifications to.\n    ``fruitmessage``: Optional: This sets the message to send when the tree is dropping fruit. If not set, the ``watermessage`` will be used instead.\n</rolemenu:0> - Creates a menu for users to give themselves Water and Fruit pingable roles.\n    Requires ``Manage Roles`` permission to run.\n    ``waterrole``: Select the role to give users when they select the Water button\n    ``fruitrole``: Optional: Select the role to give users when they select the Fruit button\n        If this option isn't set, no Fruit Role will be available for self-assignment.\n</watertime:1066970330029113444> - Calculates the wait time between waters for a tree of a given height.\n    ``height``: The height in feet to calculate for.\n</timetoheight:1067727254634889227> - Calculates how long it would take to grow to a height\n    ``endheight``: The destination height, in feet.\n    ``beginheight``: Optional: The starting height, in feet. If this option isn't set, the current height of your tree will be used insead.\n</reset:1065412317052944476> - Removes your server's configuration from the database.\n</help:1065346941166297129> - Displays the bot's help page and links to each command."
	},
	"commands": {
		"compare": "</compare:1065346941166297128>",
		"setup": "</setup:1065407649363005561>",
		"watertime": "</watertime:1066970330029113444>",
		"setupinfo": "</setupinfo:1065413032374706196>",
		"reset": "</reset:1065412317052944476>",
		"help": "</help:1065346941166297129>"
	},
	"embeds": {
		"footer": "Silvanus is not affiliated with Grow A Tree or Limbo Labs",
		"color": "0x55FF55",
		"waterColor": "0x5555FF",
		"fruitColor": "0xCC5555",
		"waterTitle": "Water Notification",
		"fruitTitle": "Fruit Notification",
		"roleMenuTitle": "Role Menu",
		"treeRoleMenu": [
			"Use the buttons below to give yourself roles.\n\n",
			"``💧`` - ",
			": Get notifications when the tree is ready to be watered.",
			"\n``🍎`` - ",
			": Get notifications when fruit is falling from the tree."
		],
		"roleMenuFooter": "Tip: Tap the button again to remove the role."
	},
	"emoji": {
		"joint": "<:joint:862082955902976000>",
		"next": "⏭️",
		"previous": "⏮️",
		"confirm": "☑️",
		"cancel": "❌",
		"water": "💧",
		"fruit": "🍎"
	},
	"urls": {
		"avatar": "https://cdn.discordapp.com/avatars/513184762073055252/12227aa23a06d5178853e59b72c7487b.webp?size=128",
		"supportServer": "https://discord.gg/g5JRGn7PxU"
	},
	"error": {
		"noGuild": "Setup has not been completed yet. Try running </setup:1065407649363005561> or </help setup:1065346941166297129>"
	},
	"status": {
		"treeAndLeaderboard": "Tree and leaderboard messages were both found, setup is complete. Run </setupinfo:1065413032374706196> to verify. Run </compare:1065346941166297128> to get started!",
		"missingMessage": "I was unable to find both a ``/tree`` and ``/top trees`` message in this channel. Please run </setup:1065407649363005561> to set up separate ``/tree`` and ``/top trees`` channels.",
		"noneFound": "Unable to find a tree or leaderboard in the last 20 messages in this channel, make sure you've run ``/tree`` and/or ``/top trees`` recently.",
		"missingLeaderboardMessage": "There was a problem finding the Tallest Trees message. Please make sure the ``/tree`` and ``/top trees`` messages are in this channel, or run </setup:1065407649363005561> to set the ``/tree`` and ``/top trees`` channels.",
		"missingLeaderboardChannel": "There was a problem finding the Tallest Trees channel, was it deleted? Please make sure the ``/tree`` and ``/top trees`` messages are in this channel, or run </setup:1065407649363005561> to set the ``/tree`` and ``/top trees`` channels.",
		"missingTreeMessage": "There was a problem finding the Tree message. Please make sure the ``/tree`` and ``/top trees`` messages are this channel, or run </setup:1065407649363005561> to set the ``/tree`` and ``/top trees`` channels.",
		"missingTreeChannel": "There was a problem finding the Tree channel, was it deleted? Please make sure the ``/tree`` and ``/top trees`` messages are in this channel, or run </setup:1065407649363005561> to set the ``/tree`` and ``/top trees`` channels.",
		"reset": "All guild configuration information has been removed from the database.",
		"resetError": "There was a problem deleting your guild information, contact @voidf1sh#0420 for help.",
		"noRoleMenu": "A role menu has not been created for this guild yet. Run </setup rolemenu:0> to create a role menu."
	},
	"notifications": {
		"water": "is ready to be watered again!",
		"fruit": "Fruit is appearing!"
	},
	"temp": {}
}